20241127T222339--kdoc-312-汎整数拡張を確かめる__wiki.org
:properties:
:ID: 20241127T222339
:mtime:    20241130215812
:ctime:    20241127222340
:end:
#+title:      KDOC 312: 汎整数拡張を確かめる
#+date:       [2024-11-27 Wed 22:23]
#+filetags:   :wiki:
#+identifier: 20241127T222339

* この文書のステータス
- 作成
  - [X] 2024-11-27 貴島
- レビュー
  - [X] 2024-11-30 貴島

* 概要
汎整数拡張は、intが元の型のすべての値を表現できる場合はintに変換し、そうでない場合はunsigned intに変換すること。

確かめる。

#+caption: char*charの結果が200になる。もしcharの範囲で計算していたら127より大きい計算結果を表現できないはずである
#+begin_src C
  signed char result1, c1, c2, c3;
  signed int result2;
  c1 = 100;
  c2 = 2;
  result1 = c1 * c2;
  result2 = c1 * c2;
  printf("char: %d\n", result1);
  printf("int: %d\n", result2);
#+end_src

#+RESULTS:
#+begin_src
char: -56
int: 200
#+end_src

* 関連
- [[id:20241117T002732][KDOC 293: 『超例解Linuxカーネルプログラミング』]]。で知った仕様
