20241127T222339--kdoc-312-汎整数拡張を確かめる__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:06:05Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 312: 汎整数拡張を確かめる</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 312: 汎整数拡張を確かめる</h1>
<div id="outline-container-org3e17d26" class="outline-2">
<h2 id="org3e17d26"><a href="#org3e17d26">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org3e17d26">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-27 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-30 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org08e3908" class="outline-2">
<h2 id="org08e3908"><a href="#org08e3908">概要</a></h2>
<div class="outline-text-2" id="text-org08e3908">
<p>
汎整数拡張は、intが元の型のすべての値を表現できる場合はintに変換し、そうでない場合はunsigned intに変換すること。
</p>

<p>
確かめる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>char*charの結果が200になる。もしcharの範囲で計算していたら127より大きい計算結果を表現できないはずである</label><pre class="src src-C"><span class="org-type">signed</span> <span class="org-type">char</span> <span class="org-variable-name">result1</span>, <span class="org-variable-name">c1</span>, <span class="org-variable-name">c2</span>, <span class="org-variable-name">c3</span>;
<span class="org-type">signed</span> <span class="org-type">int</span> <span class="org-variable-name">result2</span>;
c1 = 100;
c2 = 2;
result1 = c1 * c2;
result2 = c1 * c2;
printf(<span class="org-string">"char: %d\n"</span>, result1);
printf(<span class="org-string">"int: %d\n"</span>, result2);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">char: -56
int: 200
</pre>
</div>
</div>
</div>
<div id="outline-container-orga2988c8" class="outline-2">
<h2 id="orga2988c8"><a href="#orga2988c8">関連</a></h2>
<div class="outline-text-2" id="text-orga2988c8">
<ul class="org-ul">
<li><a href="20241117T002732--kdoc-293-『超例解linuxカーネルプログラミング』__book.html#ID-20241117T002732">KDOC 293: 『超例解Linuxカーネルプログラミング』</a>。で知った仕様</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
